#### Unset Method

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

This method is deprecated in Revit 2023 and must no longer be part of public API. It should be called by internals of Toolkit wrapper only.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute] public void Unset() ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute> _ Public Sub Unset ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute] public: void Unset() ``` |

# See Also

IFCAnyHandle Class

Autodesk.Revit.DB.IFC Namespace